export const tipsData = [
  {
    name: "早上早起",
    content: "早上8点前起床，并保证每晚至少7小时睡眠，维持规律的作息时间。",
  },
  {
    name: "1 小时无干扰的晨间仪式",
    content:
      "起床后的一小时，避免电话 / 社媒干扰，专注于晨间活动。冥想 / 喝咖啡 / 散步 / 思考都可以，自由组合活动，打造属于自己的晨间仪式。",
  },
  {
    name: "1 小时的运动",
    content:
      "地点不限，形式不限，散步、拉伸、瑜伽、骑车都可以，只需要保证每天都进行 1 小时的身体活动。",
  },
  {
    name: "阅读 10 页书",
    content:
      "读任何你喜欢的书籍或文章。可以放在睡前完成，有助于尽早入睡，避免熬夜玩手机。",
  },
  {
    name: "花 1 小时学习新技能",
    content:
      "在挑战开始前确定自己感兴趣的技能和目标，例如绘画、乐器、新语言等。把手机扔得远远的，高度集中注意力进行学习。",
  },
  {
    name: "健康饮食",
    content: "告别酒精、软饮料、垃圾食品，低糖饮食，并饮用足够多的水。",
  },
  {
    name: "记录过程",
    content:
      "通过写日记或录视频等形式记录全过程，比如自己在挑战中产生的积极或消极的感受，今天学到了什么，以及可以改进的地方等等。",
  },
];

export const progressTips = [
  {
    progress: "0",
    words: "刚刚起步，坚持下去",
  },
  {
    progress: "20",
    words: "继续保持，你会有好的结果！",
  },
  {
    progress: "40",
    words: "你已经有了不错的进展，继续加油！",
  },
  {
    progress: "60",
    words: "你已经有了不错的结果，继续保持！",
  },
  {
    progress: "80",
    words: "你已经保持了很好的进展，继续加油！",
  },
  {
    progress: "100",
    words: "恭喜你，完成了挑战！",
  },
];

export const themeName = "时记小屋";
export const themeDesc =
  "每天进步一点点，养成习惯，记录自己的50天挑战，遇见更美好的自己！";

export const aboutTips = `${themeName}是一款帮助用户养成好习惯的小程序。${themeDesc}`;

export const someWords1 =
  "项目灵感来自于网上的project50挑战，于是就有了这款应用:你可用它记录自己的50天挑战，也可以用它日常打卡，比如减肥、学习、运动等，每一个小小的坚持，都值得被记录。如果在使用过程中有任何问题或者更好的建议，欢迎反馈，我将尽快解决，如果觉得还不错，欢迎分享给你的朋友哦.后续有什么好玩的容易实现的玩法我也希望和大家分享~~";

export const someWords2 = [
  "每一个伟大的旅程都始于第一步，你已经迈出了这一步。",
  "不要低估每天小小的进步，50天后，这些进步将汇聚成令人惊叹的改变。",
  "你比想象中更强大，更有韧性。相信自己坚持下去。",
  "每一个开始都是微不足道的，每一步坚持都是困难的，但给自己一个机会，会不会遇见更好的自己?",
];
export const feedbackTips =
  "如有任何问题或建议，请发送邮件至:1129986876@qq.com或添加开发者wx【clown】";

export const monthWords = [
  "一月，檐下冰棱渐融，藏着旧岁的余温，也候着新程的微光。",
  "二月，梅香漫过窗棂，裹着团圆的暖意，也衔着萌芽的讯息。",
  "三月，雨丝织绿柳梢，缠着薄雾的朦胧，也系着花开的信约。",
  "四月，风拂过青麦浪，带着清明的静穆，也载着春光的漫漶。",
  "五月，蝉鸣初叩夏门，浸着劳作的汗水，也漾着榴花的炽烈。",
  "六月，荷风掠过池面，携着梅雨的缠绵，也托着栀子的清芬。",
  "七月，流萤点亮夜色，藏着骤雨的微凉，也盛着蝉夏的欢腾。",
  "八月，桂影爬上篱墙，凝着骄阳的灼热，也酿着仲秋的甜香。",
  "九月，雁阵划过高天，载着离人的惦念，也铺着稻穗的金黄。",
  "十月，霜色轻点枫叶，染着秋深的清寂，也燃着丰收的殷实。",
  "十一月，朔风卷落残叶，裹着初寒的凛冽，也藏着松涛的坚韧。",
  "十二月，雪落覆盖尘埃，封存一年的故事，也孕育来年的期许。",
];
export const colorArray = [
  { value: 50, color: "#c2ffeb" },
  { value: 100, color: "#b3fddc" },
  { value: 200, color: "#a5eece" },
  { value: 300, color: "#98e0c0" },
  { value: 400, color: "#8ad2b3" },
  { value: 500, color: "#83cbac" },
  { value: 600, color: "#4f9679" },
  { value: 700, color: "#166449" },
  { value: 800, color: "#00351e" },
  { value: 900, color: "#001504" },
  { value: 950, color: "#000200" },
];

export const recordTips = "那些早起看过的晨光，终将都变成照亮前路的星火";

export const zhangTips = [
  {
    name: "坚持10天",
    content: "连续坚持10天，初露锋芒",
  },
  {
    name: "坚持20天",
    content: "连续坚持 20 天，渐入佳境",
  },
  {
    name: "坚持30天",
    content: "连续坚持 30 天，习惯养成",
  },
  {
    name: "坚持40天",
    content: "连续坚持 40 天，成效显现",
  },
  {
    name: "坚持50天",
    content: "连续坚持 50 天，实力进阶",
  },
];

export const chengjiuTips = "给时光以生命,而不是给生命以时光";
